src/InformationRegisters/Scan_ОчередьПоОтправкеПисем/Scan_ОчередьПоОтправкеПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ОчередьПоОтправкеПисем</name>
  <resources>
    <name>ПараметрыОтправки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШаблонПисьма</name>
    <type>
      <types>CatalogRef.Scan_ШаблоныПисем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтправки</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
      <types>DocumentRef.Scan_ЧекЛистТехническогоСостоянияИзделия</types>
      <types>DocumentRef.Scan_ЗаявкаНаСервисныеРаботы</types>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
      <types>DocumentRef.Scan_ЗаявкаНаОтгрузку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ОчередьПоОтправкеПисем/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	// Rarus tenkam 14.10.2021 Sonar АПК
	
	Процедура ЗаписьЗначенияРегистраСведения(ДокументОтправки, ШаблонПисьма, ПараметрыОтправки = Неопределено, НаДату = Неопределено, Пользователь = Неопределено) Экспорт	// rarus tenkam 04.08.2021 mantis 18062 +++	
		
		Отказ = Ложь;
		Если НЕ ЗначениеЗаполнено(ДокументОтправки) Тогда
			Возврат;
		КонецЕсли;
		Если НаДату = Неопределено Тогда
			ДатаЗаписи = ТекущаяДата();
		Иначе
			ДатаЗаписи = НаДату;
		КонецЕсли; 
		
		Если Пользователь = Неопределено Тогда
			ТекПользователь = Пользователи.АвторизованныйПользователь(); // Rarus tenkam 14.10.2021 Sonar АПК
		Иначе
			ТекПользователь = Пользователь;
		КонецЕсли;
		
		ЗаписьРегСведений = РегистрыСведений.Scan_ОчередьПоОтправкеПисем.СоздатьМенеджерЗаписи();
		ЗаписьРегСведений.ШаблонПисьма = ШаблонПисьма;
		ЗаписьРегСведений.ДокументОтправки = ДокументОтправки;
		
		ЗаписьРегСведений.ПараметрыОтправки	= ПараметрыОтправки;
		ЗаписьРегСведений.Пользователь 	= ТекПользователь;
		ЗаписьРегСведений.ДатаРегистрации = ДатаЗаписи;
		
		Попытка
			ЗаписьРегСведений.Записать();				
		Исключение
			ТекстСообщения = Нстр("ru = 'Ошибка записи шаблона <'; en = 'Error recording template  <'") + ШаблонПисьма + 
							НСтр("ru = '> : по документу'; en = '> by document: '") + ДокументОтправки + 
							НСтр("ru = '. Текст ошибки: '; en = '. error: '") + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); // Rarus tenkam 06.07.2022 mantis 18726 АПК + (НСтр)		
			ЗаписьЖурналаРегистрации(НСтр("ru='Регистр сведений.Очередь по отправке реквизитов в 1БД (scania)'",ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения); // Rarus tenkam 06.07.2022 mantis 18726 АПК + (НСтр)
			Отказ = Истина;
		КонецПопытки; 
		
		Возврат;
	КонецПроцедуры // ЗаписьЗначенияРегистраСведения()
	// rarus tenkam 04.08.2021 mantis 18062 ---
#КонецЕсли

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
